cases/Biofilm_growth/multi_pores/yxs/cyclic-yxs-1/0/eps
/*--------------------------------*- C++ -*----------------------------------*\
 =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField    nonuniform List<scalar> 
31250
(
1
1
1
1
1
1
1
0.0001
...
1


);

boundaryField
{

    
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
     bottom
    {
       type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
